ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/startup_M2354.c
/* Add '__attribute__((naked))' here to make sure compiler does not generate prologue and
 * epilogue sequences for Reset_Handler. We don't want MSP is updated by compiler-generated
 * code during stack switch. 
 *
 * Don't allow extended assembly in naked functions:
 * The compiler only supports basic __asm statements in __attribute__((naked))
 * functions. Using extended assembly, parameter references or mixing C code with
 * __asm statements might not work reliably. 
 */
__attribute__((naked)) void Reset_Handler(void)
{
#if defined(__GNUC__)
    __asm(".syntax  unified                                         \n");
#endif

    /* Secure TFM requires PSP as boot stack */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) && (TFM_LVL > 0)
    /* Get stack limit for PSP */
#if !defined(__ICCARM__)
    __asm("movw     r0, #:lower16:StackLimit_PSP                    \n");
    __asm("movt     r0, #:upper16:StackLimit_PSP                    \n");
#else
    __asm("mov32    r0, StackLimit_PSP                              \n");
#endif
    __asm("blx      r0                                              \n");

    /* Switch from MSP to PSP */
    __asm("msr      psp, r0                                         \n");
    __asm("mrs      r0, control                                     \n");
    __asm("movs     r1, #2                                          \n");
    __asm("orrs     r0, r1                                          \n");
    __asm("msr      control, r0                                     \n");
#endif

    /* Jump to Reset_Handler_1 */
#if !defined(__ICCARM__)
    __asm("movw     r0, #:lower16:Reset_Handler_1                   \n");
    __asm("movt     r0, #:upper16:Reset_Handler_1                   \n");
#else
    __asm("mov32    r0, Reset_Handler_1                             \n");
#endif
    __asm("bx       r0                                              \n");
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) && (TFM_LVL > 0)
/* Return stack limit for PSP */
uint32_t StackLimit_PSP(void)
{
    uint32_t stacklimit_psp;

    __asm volatile (
#if defined(__GNUC__)
        ".syntax  unified                                           \n"
#endif
        "mov    %[Rd], %[Rn]                                        \n"
        : [Rd] "=r" (stacklimit_psp)                                    /* comma-separated list of output operands */
        : [Rn] "r" (&Image$$ARM_LIB_STACK$$ZI$$Limit)                   /* comma-separated list of input operands */
        : "cc"                                                          /* comma-separated list of clobbered resources */
    );

    return stacklimit_psp;
}
#endif

void Reset_Handler_1(void)
{
    /* SystemInit() must be called at the very start. */
    SystemInit();
    
#if defined(__ARMCC_VERSION)
    __main();
    
#elif defined(__ICCARM__)
    __iar_program_start();

#elif defined(__GNUC__)
    /* Move (multiple) .data section(s) from ROM to RAM */
    {
        /* Struct of copy table entry which must match linker script */
        typedef struct copy_table_entry_ {
            uint32_t    src;            // Address to copy from
            uint32_t    dst;            // Address to copy to
            uint32_t    size;           // Copy size in bytes
        } copy_table_entry;

        copy_table_entry *copy_table_ind = (copy_table_entry *) &__copy_table_start__;
        copy_table_entry *copy_table_end = (copy_table_entry *) &__copy_table_end__;

        for (; copy_table_ind != copy_table_end; copy_table_ind ++) {
            uint32_t *src_ind = (uint32_t *) copy_table_ind->src;
            uint32_t *src_end = (uint32_t *) (copy_table_ind->src + copy_table_ind->size);
            uint32_t *dst_ind = (uint32_t *) copy_table_ind->dst;
            if (src_ind != dst_ind) {
                for (; src_ind < src_end;) {
                    *dst_ind ++ = *src_ind ++;
                }
            }
        }
    }

    /* Initialize (multiple) .bss sections to zero */
    {
        /* Struct of zero table entry which must match linker script */
        typedef struct zero_table_entry_ {
            uint32_t    start;          // Address to start zero'ing
            uint32_t    size;           // Zero size in bytes
        } zero_table_entry;

        zero_table_entry *zero_table_ind = (zero_table_entry *) &__zero_table_start__;
        zero_table_entry *zero_table_end = (zero_table_entry *) &__zero_table_end__;

        for (; zero_table_ind != zero_table_end; zero_table_ind ++) {
            uint32_t *dst_ind = (uint32_t *) zero_table_ind->start;
            uint32_t *dst_end = (uint32_t *) (zero_table_ind->start + zero_table_ind->size);

            for (; dst_ind < dst_end; ) {
                *dst_ind ++ = 0;
            }
        }
    }

    _start();

#endif

    /* Infinite loop */
    while (1);
}

/**
 * \brief Default interrupt handler for unused IRQs.
 */
void Default_Handler(void)
{
    while (1);
}
